### install and import panda

In [ ]:
%pip install pandas

In [2]:
import pandas as pd

In [3]:
import numpy as np

### Series
#### what is pandas series

In [ ]:
data = [1,2,3,4,5]

series = pd.Series(data)
print(series)

In [ ]:
data1 = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data1)
print(series_dict)
print(type(series_dict))

In [4]:
data2 = [10,20,30]

index1 = ['a','b','c']

series_custom = pd.Series(data2, index=index1)

print(series_custom)

a    10
b    20
c    30
dtype: int64

### Understanding the Data

In [ ]:
# shape , structre, column names, data types

### DataFrame

In [5]:
data = {
    'name': ['krish','kevin','jack'],
    'age': [25, 30, 45],
    'city':['bangalore','new york','florida']
}

df = pd.DataFrame(data)
print(df)

    name  age       city
0  krish   25  bangalore
1  kevin   30   new york
2   jack   45    florida

In [103]:
data = [
    {"name":"Thameem",'age':20,'place':'India'},
    {"name":"kevin",'age':25,'place':'Uk'},
    {"name":"anvar",'age':30,'place':'India'},
    {"name":"peter",'age':18,'place':'Spain'}
]

dt = pd.DataFrame(data)
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

## Reading Data from CSV file

In [7]:
df = pd.read_csv("sales_data.csv")
print(df.head())

                              Region                Country        Item Type  \
0              Australia and Oceania                 Tuvalu        Baby Food
1  Central America and the Caribbean                Grenada           Cereal
2                             Europe                 Russia  Office Supplies
3                 Sub-Saharan Africa  Sao Tome and Principe           Fruits
4                 Sub-Saharan Africa                 Rwanda  Office Supplies

  Sales Channel Order Priority Order Date   Order ID  Ship Date  Units Sold  \
0       Offline              H  5/28/2010  669165933  6/27/2010        9925
1        Online              C  8/22/2012  963881480  9/15/2012        2804
2       Offline              L   5/2/2014  341417157   5/8/2014        1779
3        Online              C  6/20/2014  514321792   7/5/2014        8102
4       Offline              L   2/1/2013  115456712   2/6/2013        5062

   Unit Price  Unit Cost  Total Revenue  Total Cost  Total Profit
0      255.28     159.42     2533654.00  1582243.50     951410.50
1      205.70     117.11      576782.80   328376.44     248406.36
2      651.21     524.96     1158502.59   933903.84     224598.75
3        9.33       6.92       75591.66    56065.84      19525.82
4      651.21     524.96     3296425.02  2657347.52     639077.50

## Viewing or Accessing , selecting & filtering  Data in DataFrame

In [10]:
# head , tail, sample (random rows), shape, info, describe
# columns (column names), index (row labels), loc[] (label based access), iloc (index based access)

In [8]:
df['Region']

0                 Australia and Oceania
1     Central America and the Caribbean
2                                Europe
3                    Sub-Saharan Africa
4                    Sub-Saharan Africa
                    ...
95                   Sub-Saharan Africa
96                                 Asia
97                   Sub-Saharan Africa
98                        North America
99                   Sub-Saharan Africa
Name: Region, Length: 100, dtype: object

In [32]:
# loc is for label based , here label for row region europe is 2 , here label for row is numbers
df.loc[2]

Region                     Europe
Country                    Russia
Item Type         Office Supplies
Sales Channel             Offline
Order Priority                  L
Order Date               5/2/2014
Order ID                341417157
Ship Date                5/8/2014
Units Sold                   1779
Unit Price                 651.21
Unit Cost                  524.96
Total Revenue          1158502.59
Total Cost              933903.84
Total Profit            224598.75
Name: 2, dtype: object

In [ ]:
df.loc[1]

In [25]:
# df.loc[row,column] 
df.loc[0,'Country']

'Tuvalu'

In [30]:
gf = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Evan'],
    'age' : [25, 30, 35, 28, 40],
    'city': ['NY', 'LA', 'SF', 'NY', 'LA'],
    'score':[88, 92, 79, 85, 90]
}, index=['a','b','c','d','e'])
gf

      name  age city  score
a    Alice   25   NY     88
b      Bob   30   LA     92
c  Charlie   35   SF     79
d    Diana   28   NY     85
e     Evan   40   LA     90

In [31]:
gf.loc['a']

name     Alice
age         25
city        NY
score       88
Name: a, dtype: object

In [33]:
gf.loc['b', 'name']

'Bob'

In [34]:
# Single row label, multiple columns
gf.loc['c', ['name', 'score']]

name     Charlie
score         79
Name: c, dtype: object

In [35]:
# Multiple row labels, single column
gf.loc[['a','b','c'], 'name']

a      Alice
b        Bob
c    Charlie
Name: name, dtype: object

In [37]:
# Row slice by labels, column slice by labels
gf.loc['b':'d', 'age':'score']

   age city  score
b   30   LA     92
c   35   SF     79
d   28   NY     85

In [38]:
# Boolean mask for rows, list for columns
gf.loc[gf['score'] >=90, ['name', 'score']]

   name  score
b   Bob     92
e  Evan     90

In [40]:
gf.loc[gf['age'] >=25, ['name', 'age']]

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35
d    Diana   28
e     Evan   40

In [41]:
# Direct boolean/list form
gf.loc[(gf['age'] >=25) & (gf['age'] <30), ['name', 'age']]

    name  age
a  Alice   25
d  Diana   28

In [42]:
# All rows, subset of columns
gf.loc[:,['name','age']]

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35
d    Diana   28
e     Evan   40

In [43]:
# Conditional row selection with single column
gf.loc[gf['city']=='NY', 'name']

a    Alice
d    Diana
Name: name, dtype: object

In [59]:
# callable form
gf.loc[lambda d: d['age'] > 18 , lambda d: ['name','age']]

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35
d    Diana   28
e     Evan   40

Key differences

Syntax: callable vs direct expressions/literals.
Evaluation context: callables receive the current DataFrame (handy in method chains); direct expressions reference variables in scope.
Behavior: result is the same when the callable returns the same indexers, but callables improve readability and composability in chained pipelines.


Summary: Use the callable form when you want selection logic to be evaluated with the DataFrame passed into .loc (especially in chained operations); use direct boolean/list form for straightforward, immediate selection.

In [51]:
# settings values for selected cells 
gf.loc['a':'c', 'score'] = 98
gf

      name  age city  score
a    Alice   25   NY     98
b      Bob   30   LA     98
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [57]:
# Mix of label slice and boolean column mask (using columns list comprehension)
cols = [c for c in gf.columns if c.startswith('s')] # this returns column starts with 's' here it is score , so cols = score
gf.loc['a':'d', cols]

   score
a     98
b     98
c     98
d     85

In [60]:
df.iloc[0,0]

'Australia and Oceania'

In [67]:
gf

      name  age city  score
a    Alice   25   NY     98
b      Bob   30   LA     98
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [71]:
# single row and multiple column
gf.iloc[1,[0,3]] # 0 for name and 3 for score

name     Bob
score     98
Name: b, dtype: object

In [73]:
# multiple row and single column
gf.iloc[[0,2,4], 0]

a      Alice
c    Charlie
e       Evan
Name: name, dtype: object

In [75]:
# multiple row and column
gf.iloc[[0,2,4], [0,3]]

      name  score
a    Alice     98
c  Charlie     98
e     Evan     90

In [76]:
# row slice and column slice
gf.iloc[1:3, 0:3]

      name  age city
b      Bob   30   LA
c  Charlie   35   SF

In [78]:
# all row and subset of columns 
gf.iloc[:, [0,3]]

      name  score
a    Alice     98
b      Bob     98
c  Charlie     98
d    Diana     85
e     Evan     90

In [80]:
# Boolean mask by position (must be same length as axis)
mask = gf['score'] > 25
gf.iloc[mask.values, [0,1]]
# mask = df['age'] > 30  this Creates a boolean Series indexed by df.index
# .iloc expects positional indexers. Passing mask.values selects rows by position where the boolean array is True (same shape as number of rows)

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35
d    Diana   28
e     Evan   40

In [87]:
# Negative indices (count from end)
gf.iloc[-2:, :]

    name  age city  score
d  Diana   28   NY     85
e   Evan   40   LA     90

In [88]:
# using numpy functions for position
import numpy as np

In [93]:
rows = np.where(gf['score'] >=90)[0]
rows
gf.iloc[rows, [0,3]]

      name  score
a    Alice     98
b      Bob     98
c  Charlie     98
e     Evan     90

In [100]:
# assign by position 
gf.iloc[1, 1] = 29

In [112]:
gf.iloc[0:2, 3] = [99, 100]
gf

      name  age city  score
a    Alice   25   NY     99
b      Bob   29   LA    100
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [116]:
df.iloc[1,2]

'Cereal'

In [119]:
# at and iat ,   at - fast label based scalar access ,    iat - fast position based scalar access

# at
gf.at['a', 'age']

np.int64(25)

In [121]:
gf.at['a', 'name']      # at is faster than loc , but only single value

'Alice'

In [62]:
df.at[1, 'Region']

'Central America and the Caribbean'

In [63]:
df.at[2, 'Item Type']

'Office Supplies'

In [124]:
# iat - get or set one value by position 
gf.iat[0, 2]

'NY'

In [127]:
gf.iat[1, 0]

'Bob'

In [64]:
df.iat[2, 2]

'Office Supplies'

In [65]:
df.iat[2, 3]   # iat - Fastest access and single value

'Offline'

In [129]:
# single condition filtering 
gf[gf['age'] > 30]

      name  age city  score
c  Charlie   35   SF     98
e     Evan   40   LA     90

In [136]:
# multiple condition filtering 
gf[(gf['age'] > 23) & (gf['score'] > 95)]

      name  age city  score
a    Alice   25   NY     99
b      Bob   29   LA    100
c  Charlie   35   SF     98

In [140]:
# or condition 
gf[(gf['age'] > 26) | (gf['score'] > 98)]

      name  age city  score
a    Alice   25   NY     99
b      Bob   29   LA    100
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [146]:
# isin
gf[gf['name'].isin(['Alice','Thameem','John','Bob'])]

    name  age city  score
a  Alice   25   NY     99
b    Bob   29   LA    100

In [153]:
gf

      name  age city  score
a    Alice   25   NY     99
b      Bob   29   LA    100
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [152]:
gf[gf['age'].isin([20,24,26,28,30,35,40])]

      name  age city  score
c  Charlie   35   SF     98
d    Diana   28   NY     85
e     Evan   40   LA     90

In [154]:
# query
gf.query('age > 25 and score > 98')

  name  age city  score
b  Bob   29   LA    100

## Data Manipulation & Cleaning Data

In [106]:
df['Unit Price']

0     255.28
1     205.70
2     651.21
3       9.33
4     651.21
       ...
95    109.28
96      9.33
97    154.06
98     81.73
99    668.27
Name: Unit Price, Length: 100, dtype: float64

In [107]:
dt

      name  age  place  projects
0  Thameem   20  India        58
1    kevin   25     Uk        77
2    anvar   30  India        22
3    peter   18  Spain        14

In [108]:
dt['projects'] = [58, 77, 22, 14]

print(dt)

      name  age  place  projects
0  Thameem   20  India        58
1    kevin   25     Uk        77
2    anvar   30  India        22
3    peter   18  Spain        14

In [109]:
dt.drop('projects', axis=1, inplace=True)  # here, axis=0 means row , axis=1 means column , Changes the original DataFrame
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

### drop() = remove
### axis=1  column
### axis=0  row
### inplace=True  permanent

In [ ]:
dt['age'] = dt['age'] + 1
dt

In [ ]:
dt.drop(3, inplace=True)
print(dt)

## DataFrame attributes and methods

In [ ]:
print(dt.head())
print(dt.dtypes)
print(dt.describe())

# Sample Data

In [166]:
df = pd.DataFrame({
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Emma', 'Liam', 'Olivia', 'Noah', 'Ava', 'Mia', 'Ethan', 'Sophia', 'James', 'Isabella'],
    'Gender': ['F', 'M', 'F', 'M', 'F', 'F', 'M', 'F', 'M', 'F'],
    'Branch': ['CSE', 'CSE', 'ECE', 'ECE', 'ME', 'CSE', 'ME', 'ECE', 'CSE', 'CSE'],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Chennai', 'Hyderabad', 'Pune', 'Bangalore', 'Delhi', 'Chennai'],
    'Score': [88, 76, 92, 65, 70, 95, 58, 81, 73, 90],
    'Attendance (%)': [90, 85, 80, 75, 88, 70, 60, 92, 89, 78],
    'Skill Rating (1-10)': [9, 7, 8, 5, 6, 10, 4, 9, 7, 8],
    'Projects Completed': [12, 8, 10, 5, 7, 15, 3, 11, 9, 13],
    'Email': [
        'emma@gmail.com', 'liam@gmail.com', 'olivia@yahoo.com', 'noah@outlook.com', 
        'ava@gmail.com', 'mia@gmail.com', 'ethan@yahoo.com', 'sophia@gmail.com',
        'james@outlook.com', 'isabella@gmail.com'
    ]
})

In [ ]:
df

### Updating & Replacing

In [ ]:
# updating single cell
df.loc[1] # students Liam
df.loc[1, 'City'] = 'Pune'
af = df.rename(columns={'Attendance (%)':'Attendance'})
af

In [ ]:
# using iloc
df.iloc[3, 3]='CSE' # changed branch of student Noah with index 3 from ECE to CSE
df

In [ ]:
# Updating Multiple Column at once
df['Score'] = df['Score'] + 1
df

In [ ]:
# Add a column based on another column

df['Result'] = df['Score'].apply(lambda x: 'Pass' if x>= 70 else 'Fail')  
df

### Deleting & Cleaning & Null Handling

In [ ]:
# Deleting a specific content
df = df.drop(9, axis=0)

In [131]:
df.loc[df['Name'] =='Emma', 'Score'] = np.nan
df.loc[df['Student_ID'] ==108, 'Attendance'] = np.nan
df.loc[df['Student_ID'] ==103, 'Branch'] = np.nan

In [123]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [ ]:
# Filling NaN Values with zero clean the data
df['Score'] =df['Score'].fillna(0)
df['Score']

df.loc[df['Student_ID']==103,'Branch']='ME'
df

In [124]:
# Filling all the NaN value with 0 any

df = df.fillna(0)

In [ ]:
# changing the original DataFrame directly , so no need of df = df.fillna
# df.fillna(0, inplace=True)

df.fillna(0, inplace=True)

### Filling NaN values based on mean / median / mode

In [ ]:
mean_score = df['Attendance'].mean()
df['Attendance'] = df['Attendance'].fillna(mean_score)

In [165]:
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,9/3/2011,888,109.28,35.84,97040.64,31825.92,65214.72
96,Asia,Malaysia,Fruits,Offline,L,11/11/2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [ ]:
df['Score'].fillna(df['Score'].mean())

In [ ]:
# filling NaN with median 
df['Score'].fillna(df['Score'].median())

In [ ]:
# Filling NaN with most frequent value (mode)

df['Attendance'] = df['Attendance'].fillna(df['Attendance'].mode())
df

In [ ]:
df['Branch'] = df['Branch'].fillna(df['Branch'].mode()[0])
df

In [ ]:
# Fill NaN Forward or Backward ;

# Forward Fill (copy previous value) -> ffill
df['Attendance'] = df['Attendance'].fillna(method='ffill')
df

In [ ]:
# Backward Fill (copy next value) -> bfill
df['Score'] = df['Score'].fillna(method='bfill')
df

In [ ]:
#  Replace Text Missing Values as NaN  Then Fill
df.replace(['NA', 'N/A', 'missing', '--'], np.nan, inplace=True)

#  then filling the NaN VALUES
df['Score'] = df['Score'].fillna('not_provided')

### Sorting, Filtering & Ranking

### Sorting

In [ ]:
# sort by single column
df.sort_values(by='Score')
df.sort_values(by='Score', ascending=False) # heighest to lowest

In [ ]:
# sort by multiple column
df.sort_values(by=['Score', 'Attendance'], ascending=[False, True])

In [ ]:
# sort index and sorting columns
df.sort_index(ascending=False)

In [ ]:
# Sort columns

df.sort_index(axis=1)

In [ ]:
# In place sorting

df.sort_values(by='Score', inplace=True)

In [ ]:
df.sort_values(by='Score', na_position='first')
df.sort_values(by='Score', na_position='last')

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [ ]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
0,101,Emma,F,CSE,Delhi,0.0,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,0.0,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,0,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [134]:
# Sort with Custom Key

df.sort_values(by='Name', key=lambda x: x.str.lower())

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass

In [167]:
df.sort_values(by='Name', key=lambda x: x.str.len())

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com

In [341]:
# Ranking

### Grouping & Aggregate

In [173]:
# groupby
a = df.groupby('Branch')

In [178]:
# Basic aggregations
# single aggregation
df.groupby('City')['Score'].mean()

City
Bangalore    81.000000
Chennai      80.000000
Delhi        84.333333
Hyderabad    95.000000
Mumbai       76.000000
Pune         61.500000
Name: Score, dtype: float64

In [180]:
# multiple aggregation
df.groupby('City')['Score'].agg(['max','min','mean'])

           max  min       mean
City
Bangalore   81   81  81.000000
Chennai     90   70  80.000000
Delhi       92   73  84.333333
Hyderabad   95   95  95.000000
Mumbai      76   76  76.000000
Pune        65   58  61.500000

In [184]:
# multiple column + aggregations
df.groupby('City').agg({
    'Score':'mean',
    'Attendance (%)':'max'
})

               Score  Attendance (%)
City
Bangalore  81.000000              92
Chennai    80.000000              88
Delhi      84.333333              90
Hyderabad  95.000000              70
Mumbai     76.000000              85
Pune       61.500000              75

In [186]:
# Groupby multiple columns
df.groupby(['City', 'Branch'])['Score'].mean()

City       Branch
Bangalore  ECE       81.0
Chennai    CSE       90.0
           ME        70.0
Delhi      CSE       80.5
           ECE       92.0
Hyderabad  CSE       95.0
Mumbai     CSE       76.0
Pune       ECE       65.0
           ME        58.0
Name: Score, dtype: float64

In [187]:
# Reset index -----Converts grouped index back to normal column
# (Required for ML pipelines)
df.groupby('City')['Score'].mean().reset_index()

        City      Score
0  Bangalore  81.000000
1    Chennai  80.000000
2      Delhi  84.333333
3  Hyderabad  95.000000
4     Mumbai  76.000000
5       Pune  61.500000

In [190]:
# named aggregation
df.groupby('City').agg(
    avg_score=('Score', 'mean'),
    total_projects=('Projects Completed', 'sum')

)

           avg_score  max_projects
City
Bangalore  81.000000            11
Chennai    80.000000            20
Delhi      84.333333            31
Hyderabad  95.000000            15
Mumbai     76.000000             8
Pune       61.500000             8

In [201]:
# filtering groups
df.groupby('City').filter(lambda x: len(x) >= 3)

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com

In [205]:
# transform() vs agg() ,   agg() - reduces rows , transform() - keeps same shape
df['city_avg_score'] = df.groupby('City')['Score'].transform('mean')
df['city_avg_score']

0    84.333333
1    76.000000
2    84.333333
3    61.500000
4    80.000000
5    95.000000
6    61.500000
7    81.000000
8    84.333333
9    80.000000
Name: city_avg_score, dtype: float64

In [230]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000

In [218]:
# syntax
# df.groupby(GROUP_KEYS)[TARGET_COL].agg(FUNCTION)

In [ ]:
# ML and Data science use case
# feature engineering 

df['Branch_avg_score'] = df.groupby('Branch')['Score'].transform('max')
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333,95
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000,95
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333,92
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000,92
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000,70
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000,95
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000,70
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000,92
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333,95
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000,95

In [252]:
df.groupby(['City','Branch'])[['Score','Attendance (%)']].agg('mean').unstack().fillna(0)

          Score             Attendance (%)
Branch      CSE   ECE    ME            CSE   ECE    ME
City
Bangalore   0.0  81.0   0.0            0.0  92.0   0.0
Chennai    90.0   0.0  70.0           78.0   0.0  88.0
Delhi      80.5  92.0   0.0           89.5  80.0   0.0
Hyderabad  95.0   0.0   0.0           70.0   0.0   0.0
Mumbai     76.0   0.0   0.0           85.0   0.0   0.0
Pune        0.0  65.0  58.0            0.0  75.0  60.0

In [255]:
# Data summarization
df.groupby('Branch').count()

,Student_ID,Name,Gender,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score
Branch,,,,,,,,,,,
CSE,5,5,5,5,5,5,5,5,5,5,5
ECE,3,3,3,3,3,3,3,3,3,3,3
ME,2,2,2,2,2,2,2,2,2,2,2

In [263]:
df['Gender'].value_counts()

Gender
F    6
M    4
Name: count, dtype: int64

In [264]:
# outlier analysis
df.groupby('Branch')['Score'].std()

Branch
CSE     9.449868
ECE    13.576941
ME      8.485281
Name: Score, dtype: float64

In [274]:
# city score std

df['branch_score_std'] = df.groupby('Branch')['Score'].transform('std')
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score,city_score_std,branch_score_std
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333,95,10.016653,9.449868
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000,95,NaN,9.449868
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333,92,10.016653,13.576941
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000,92,4.949747,13.576941
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000,70,14.142136,8.485281
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000,95,NaN,9.449868
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000,70,4.949747,8.485281
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000,92,NaN,13.576941
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333,95,10.016653,9.449868
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000,95,14.142136,9.449868

In [273]:
df['city_score_std'] = df.groupby('City')['Score'].transform('std')

In [ ]:
# Why some cities show NaN?
# Only one student  no variation possible

### concatenation & combining Data

In [275]:
# concatenation
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score,city_score_std,branch_score_std
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333,95,10.016653,9.449868
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000,95,NaN,9.449868
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333,92,10.016653,13.576941
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000,92,4.949747,13.576941
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000,70,14.142136,8.485281
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000,95,NaN,9.449868
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000,70,4.949747,8.485281
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000,92,NaN,13.576941
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333,95,10.016653,9.449868
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000,95,14.142136,9.449868

In [ ]:
# row-wise concatenation
df1 = df.iloc[:4]
df2 = df.iloc[4:]

In [289]:
pd.concat([df1,df2])

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score,city_score_std,branch_score_std
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333,95,10.016653,9.449868
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000,95,NaN,9.449868
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333,92,10.016653,13.576941
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000,92,4.949747,13.576941
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000,70,14.142136,8.485281
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000,95,NaN,9.449868
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000,70,4.949747,8.485281
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000,92,NaN,13.576941
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333,95,10.016653,9.449868
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000,95,14.142136,9.449868

In [294]:
pd.concat([df1,df2], ignore_index=True)

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email,city_avg_score,Branch_avg_score,city_score_std,branch_score_std
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com,84.333333,95,10.016653,9.449868
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com,76.000000,95,NaN,9.449868
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com,84.333333,92,10.016653,13.576941
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com,61.500000,92,4.949747,13.576941
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com,80.000000,70,14.142136,8.485281
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com,95.000000,95,NaN,9.449868
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com,61.500000,70,4.949747,8.485281
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com,81.000000,92,NaN,13.576941
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com,84.333333,95,10.016653,9.449868
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com,80.000000,95,14.142136,9.449868

In [300]:
# Row-wise Concat with Different Columns
new_students = df[['Student_ID', 'Name', 'Score']].iloc[:2]
new_students

   Student_ID  Name  Score
0         101  Emma     88
1         102  Liam     76

In [320]:
combined = pd.concat([df, new_students], join='inner')
combined

   Student_ID      Name  Score
0         101      Emma     88
1         102      Liam     76
2         103    Olivia     92
3         104      Noah     65
4         105       Ava     70
5         106       Mia     95
6         107     Ethan     58
7         108    Sophia     81
8         109     James     73
9         110  Isabella     90
0         101      Emma     88
1         102      Liam     76

In [329]:
# column-wise concatenation
features = df[['city_avg_score', 'Branch_avg_score', 
               'city_score_std', 'branch_score_std']]

df_new = pd.concat([df[['Student_ID', 'Name', 'Score']], features], axis=1)
df_new

,Student_ID,Name,Score,city_avg_score,Branch_avg_score,city_score_std,branch_score_std
0,101,Emma,88,84.333333,95,10.016653,9.449868
1,102,Liam,76,76.000000,95,NaN,9.449868
2,103,Olivia,92,84.333333,92,10.016653,13.576941
3,104,Noah,65,61.500000,92,4.949747,13.576941
4,105,Ava,70,80.000000,70,14.142136,8.485281
5,106,Mia,95,95.000000,95,NaN,9.449868
6,107,Ethan,58,61.500000,70,4.949747,8.485281
7,108,Sophia,81,81.000000,92,NaN,13.576941
8,109,James,73,84.333333,95,10.016653,9.449868
9,110,Isabella,90,80.000000,95,14.142136,9.449868

In [338]:
# add source labels
combined = pd.concat(
    [df1, df2],
    keys=['train', 'test']
)
combined

         Student_ID      Name Gender Branch       City  Score  Attendance (%)  \
train 0         101      Emma      F    CSE      Delhi     88              90
      1         102      Liam      M    CSE     Mumbai     76              85
      2         103    Olivia      F    ECE      Delhi     92              80
      3         104      Noah      M    ECE       Pune     65              75
test  4         105       Ava      F     ME    Chennai     70              88
      5         106       Mia      F    CSE  Hyderabad     95              70
      6         107     Ethan      M     ME       Pune     58              60
      7         108    Sophia      F    ECE  Bangalore     81              92
      8         109     James      M    CSE      Delhi     73              89
      9         110  Isabella      F    CSE    Chennai     90              78

         Skill Rating (1-10)  Projects Completed               Email  \
train 0                    9                  12      emma@gmail.com
      1                    7                   8      liam@gmail.com
      2                    8                  10    olivia@yahoo.com
      3                    5                   5    noah@outlook.com
test  4                    6                   7       ava@gmail.com
      5                   10                  15       mia@gmail.com
      6                    4                   3     ethan@yahoo.com
      7                    9                  11    sophia@gmail.com
      8                    7                   9   james@outlook.com
      9                    8                  13  isabella@gmail.com

         city_avg_score  Branch_avg_score  city_score_std  branch_score_std
train 0       84.333333                95       10.016653          9.449868
      1       76.000000                95             NaN          9.449868
      2       84.333333                92       10.016653         13.576941
      3       61.500000                92        4.949747         13.576941
test  4       80.000000                70       14.142136          8.485281
      5       95.000000                95             NaN          9.449868
      6       61.500000                70        4.949747          8.485281
      7       81.000000                92             NaN         13.576941
      8       84.333333                95       10.016653          9.449868
      9       80.000000                95       14.142136          9.449868

In [ ]:
# Merge


sf1 = pd.DataFrame({
    'label':['a','b','c','d'],
    'age': [10,20,30,40],
    'name':['john','jacob','sara','ali']
})

sf2 = pd.DataFrame({
    'label':['a','b','c'],
    'name':['book','pen','lap']
})

pd.merge(sf1, sf2, on='label') # default it will be inner join

  label  age name_x name_y
0     a   10   john   book
1     b   20  jacob    pen
2     c   30   sara    lap

In [ ]:
# types , using 'how'
'''
| how     | Meaning          |
| ------- | ---------------- |
| `inner` | common keys only |
| `left`  | all from left    |
| `right` | all from right   |
| `outer` | all keys         |
'''

In [349]:
pd.merge(sf1, sf2, on='label', how='left')

  label  age name_x name_y
0     a   10   john   book
1     b   20  jacob    pen
2     c   30   sara    lap
3     d   40    ali    NaN

In [350]:
# merge with different column name 

pd.merge(sf1, sf2, left_on='label', right_on='label')

  label  age name_x name_y
0     a   10   john   book
1     b   20  jacob    pen
2     c   30   sara    lap

In [ ]:
# Join

In [ ]:
# concatenation vs merge

'''
| Task          | Use              |
| ------------- | ---------------- |
| Stack rows    | `concat(axis=0)` |
| Add columns   | `concat(axis=1)` |
| Match by key  | `merge()`        |
| Join on index | `join()`         |
'''

### Date & Time handling

### Catogerical Data handling

### Exploratory Data Analysis (EDA)

### Performance & Optimization